Repository: 84000/data-translation-memory
Catalog: toh555-v3.tmx
Source language: bo
Languages: en

source: མུ་གེ་དང་རིམས་ནད་མང་པོས་གནོད་པར་གྱུར་ཏམ། ལྟས་ངན་གྱི་དངོས་པོ་བརྒྱ་སྟོང་ཚད་མ་མཆིས་པ་སྙེད་བྱུང་བར་གྱུར་ན། བཅོམ་ལྡན་འདས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ལ་བཀུར་སྟི་དང་མཆོད་པ་བགྱིད་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་གང་ལ་ལ་མདོ་སྡེ་འདི་ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་བ་ཞིག་མཆིས་པར་གྱུར་ན་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དེའི་ཐད་དུ་མཆིས་ཏེ་གོ་བར་བགྱིས་ནས་དེ་ལ་སྐུལ་ཞིང་གསོལ་བ་འདེབས་པར་བགྱིད་དེ།
en: Bhagavat, if in this Jambudvīpa there is a king of a country whose opposing enemies are always near, or there is the calamity of disease or famine, or there are a hundred thousand bad omens, then, Bhagavat, if there is a bhikṣu dharmabhāṇaka who adopts, possesses, reads, and comprehends this Supremely Victorious King of Sūtras, the Sublime Golden Light, which we Four Mahārājas venerate and make offerings to, then we Four Mahārājas will go to him to make him understand, and inspire him and supplicate him.

source: ཆོས་སྨྲ་བ་དེ་ཡང་བདག་ཅག་གི་རྫུ་འཕྲུལ་གྱིས་གོ་བར་བགྱིས་པའི་མཐུས་ཡུལ་ཁམས་དེར་མཆིས་ནས་གསེར་འོད་དམ་པ་ཤིན་ཏུ་གྱ་ནོམ་པའི་མདོ་སྡེ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་སྤེལ་བར་བགྱིད་པས་མདོ་སྡེ་འདིའི་མཐུས་གནོད་པ་དང་།
en: Then that dharmabhāṇaka, through the power of recognizing our miraculous manifestations, will go to that land and there widely promulgate this Supremely Victorious King of Sūtras, the Sublime Golden Light.

source: ལྟས་ངན་གྱི་དངོས་པོ་བརྒྱ་སྟོང་ཚད་མ་མཆིས་པ་དེ་དག་ཐམས་ཅད་ཉེ་བར་ཞི་ཞིང་ཡོངས་སུ་སེལ་བར་འགྱུར་ལགས་སོ།
en: Then, through the power of this sūtra, the hundred thousand calamities and bad omens will all cease and be dispelled. “

source: །བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གང་གི་ཡུལ་དུ་མདོ་སྡེ་འདི་ཡོངས་སུ་འཛིན་པའི་དགེ་སློང་ཆོས་སྨྲ་བ་ཡུལ་དེར་མཆིས་པར་གྱུར་ན་མདོ་སྡེ་འདི་ཡང་ཡུལ་དེར་གཤེགས་པར་རིག་པར་བགྱི་ལགས་སོ།
en: Bhagavat, in the land of whichever king the dharmabhāṇaka bhikṣu who possesses this Supremely Victorious King of Sūtras, the Sublime Golden Light goes, know that this sūtra has also gone into that land. “

source: །བཅོམ་ལྡན་འདས་དེའི་ཚེ་ཡུལ་དེའི་རྒྱལ་པོ་དེ་ཆོས་སྨྲ་བའི་ཐད་དུ་མཆིས་ནས་དེས་ཆོས་བསྟན་པ་གང་ལགས་པ་མཉན་པར་བགྱིའོ།
en: Bhagavat, at that time the king will go to the dharmabhāṇaka and will listen to whatever Dharma teaching he gives.

source: །ཐོས་ནས་ཀྱང་རབ་ཏུ་དགའ་བས་ཆོས་སྨྲ་བ་དེ་ལ་བཀུར་སྟི་དང་། མཆོད་པ་དང་། རིམ་གྲོ་བགྱིས་ཏེ།
en: Having heard it, he will be overjoyed and will honor, make offerings to, and serve that dharmabhāṇaka.

source: ཤིན་ཏུ་དང་བའི་བསམ་པས་ཡོངས་སུ་བསྲུངས་ནས་མྱ་ངན་དང་གནོད་པ་མ་མཆིས་པར་བགྱིས་ཏེ།
en: With a mind of clear faith he will protect him, and misery and calamities will cease. “

source: མདོ་སྡེ་འདི་ཡང་དག་པར་བསྟན་ནས་ཐམས་ཅད་ལ་ཕན་གདགས་པར་བགྱིའོ།
en: When this sūtra is correctly taught, it will be beneficial for everyone. “

source: །བཅོམ་ལྡན་འདས་རྒྱུ་དང་རྐྱེན་དེས་ན་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཐམས་ཅད་སེམས་རྩེ་གཅིག་ཏུ་མིའི་རྒྱལ་པོ་དེ་དང་། ཡུལ་གྱི་མི་ཐམས་ཅད་ཡོངས་སུ་བསྲུངས་ནས་གནོད་པ་རྣམས་སྤོང་ཞིང་རྟག་པར་བདེ་བ་ལ་འགོད་པར་བགྱིད་ལགས་སོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་ངམ།
en: Bhagavat, through that cause and condition, all of us Four Mahārājas will single-mindedly guard that human king and all the humans of that land so that they will be freed of calamities and always be established in happiness. “

source: དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ཡོངས་སུ་འཛིན་པར་བགྱིད་པ་ཞིག་མཆིས་པར་གྱུར་ན་དེའི་ཚེ་མིའི་རྒྱལ་པོ་དེས་ཅི་དང་ཅི་འཚལ་བ་སྦྱར་ཏེ། མཆོད་པ་བགྱིས་ནས་ཕོངས་པ་མ་མཆིས་པར་བགྱིད་པར་གྱུར་ན་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ཡུལ་གྱི་བདག་པོ་དེ་དང་ཡུལ་གྱི་མི་ཐམས་ཅད་རབ་ཏུ་བདེ་བར་བགྱིད་ཅིང་གནོད་པ་རྣམས་ཐག་རིང་དུ་སྤོང་བར་བགྱིད་དོ། །བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ལེན་པ་དང་།
en: Bhagavat, if there is a bhikṣu, bhikṣunī, upāsaka, or upāsikā who possesses this sūtra, and if at that time a human king should seek them out, and without reluctance make offerings to them, then we Four Mahārājas will bring happiness to that ruler of the land and all the people in that land and will banish calamities far away. “

source: འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པར་བགྱིས་པ་ལ་མིའི་རྒྱལ་པོ་དེས་མཆོད་པ་དང་། བཀུར་སྟི་དང་། བླ་མར་བགྱིས་ཏེ་བསྔགས་པ་བརྗོད་པར་བགྱིད་ན་བདག་ཅག་རྒྱལ་པོ་དེ་རྒྱལ་པོ་རྣམས་ཀྱི་ནང་ན་མཆོག་ཏུ་བཙུན་པ་དང་གུས་པས་བླ་མར་བགྱིས་པས་ཡུལ་གྱི་རྒྱལ་པོ་གཞན་རྣམས་ཀྱིས་ཀྱང་བསྔགས་པ་བརྗོད་པར་འགྱུར་རོ།
en: Bhagavat, if there is someone who adopts this sūtra, possesses it, reads it, and recites it, and if a human king reveres and makes offerings to and praises that person, then we Four Mahārājas will revere, venerate, and respect him above all other kings so that he will be praised by the kings of other lands.”

source: །འཁོར་མང་པོ་རྣམས་དེ་སྐད་ཅེས་ཐོས་པ་དང་རབ་ཏུ་དགའ་བས་ཡོངས་སུ་འཛིན་པར་གྱུར་ཏོ།
en: When that vast assembly heard those words, they held them with great joy.

source: །གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་ལས་རྒྱལ་པོ་ཆེན་པོ་བཞིས་ལྷ་དང་མི་རྣམས་ལ་བལྟ་ཞིང་བརྟག་པའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ།། །།གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ། བམ་པོ་དྲུག་པ།
en: This concludes “The Four Mahārājas Look Upon Devas and Humans,” the eleventh chapter of “The Supremely Victorious King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གིས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བའི་མདོ་སྡེ་ལ་བཀུར་སྟི་དང་།
en: Chapter 12: The Four Mahārājas Protecting the Land Then the Bhagavat praised the Four Mahārājas, saying “excellent, excellent!”

source: མཆོད་པ་བྱས་པ་དང་། མདོ་སྡེ་འཛིན་པ་དག་ལ་ཡོངས་སུ་སྐྱོབ་པ་དང་། ཡོངས་སུ་སྲུང་བར་བྱེད་པ་གསན་པ་དང་། ལེགས་སོ་ལེགས་སོ།
en: on hearing that they would defend and guard those who possessed the sūtra and those who honored and made offerings to the supremely victorious sūtra The Sublime Golden Light.

source: །ཞེས་བསྔགས་པ་བརྗོད་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཁྱེད་ཅག་ནི་འདས་པའི་སངས་རྒྱས་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་ལ་བཀུར་སྟི་དང་། རིམ་གྲོ་དང་། མཆོད་པ་དང་། བླ་མར་བྱས་ནས་བསྔགས་པ་བརྗོད་དེ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། ཡང་དག་པའི་ཆོས་མངོན་པར་བསྒྲུབས་ནས་རྟག་པར་ཡང་དག་པའི་ཆོས་བསྟན་ཏེ།
en: He then said, “You Four Mahārājas have honored, served, made offerings to, venerated, and praised many hundreds of thousands of quintillions of buddhas in the past, and you have generated roots of merit, have truly accomplished the Dharma, and have always taught the Dharma; by guiding the world through the Dharma in this way, you have long had the motivation of great love to constantly benefit beings.

source: འདི་ལྟར་ཆོས་ཀྱིས་འཇིག་རྟེན་འདུལ་བ་ཡིན་པས་ཁྱེད་ཅག་ཡུན་རིང་པོ་ནས་སེམས་ཅན་རྣམས་ལ་རྟག་པར་ཕན་འདོགས་ཤིང་བྱམས་པ་ཆེན་པོའི་སེམས་བསྐྱེད་ནས་བདེ་བ་སྦྱིན་པར་སྨོན་པའི་རྒྱུ་དང་རྐྱེན་དེས་ན་ཁྱེད་ཅག་ད་ལྟར་རྣམ་པར་སྨིན་པ་མཆོག་ལ་ལོངས་སྤྱོད་པ་ཡིན་ནོ།
en: Because of the cause and condition of aspiring to bring happiness, you are now enjoying its perfect ripening. “

source: །མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བའི་མདོ་སྡེ་འདི་ལ་བཀུར་སྟི་བྱས་ནས་མཆོད་པ་བྱེད་པ་ཞིག་ཡོད་ན་ཁྱེད་ཀྱིས་ནན་ཏན་བསྐྱེད་དེ་ཡོངས་སུ་བསྲུངས་ནས་བདེ་བ་འཐོབ་པར་བྱའོ།
en: If there is a king who honors and makes offerings to the supremely victorious sūtra The Sublime Golden Light, you should make an effort to guard him and cause him to obtain happiness. “You Four Mahārājas with your army, attendants, and many hundreds of thousands of yakṣas will guard the way of the Dharma of the buddha bhagavats of the past, future, and present. You will protect it and keep it in your care. “

source: །ཁྱེད་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། འཁོར་གཞན་རྣམས་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཚད་མེད་གྲངས་མེད་པ་སྙེད་ཀྱིས་མདོ་སྡེ་འདི་ཡོངས་སུ་སྲུང་བར་བྱེད་ན་དེས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་ཡང་དག་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བར་འགྱུར་བས་ཁྱེད་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་།
en: Therefore, if you Four Mahārājas, and also your followers and the countless, incalculable hundreds of thousands of yakṣas, guard this sūtra, then you will be guarding the true Dharma of the buddhas of the past, future, and present. “

source: ལྷའི་འཁོར་གཞན་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། ལྷ་མ་ཡིན་དང་འཐབ་པའི་ཚེ་རྟག་ཏུ་རྒྱལ་བའི་ཕན་ཡོན་འཐོབ་པར་འགྱུར་རོ།
en: Therefore, when you Four Mahārājas and also your deva followers and the yakṣas battle with the asuras, you will always attain the benefits of victory. “

source: །ཁྱེད་ཅག་མདོ་སྡེ་འདི་ཡོངས་སུ་བསྲུང་ཞིང་ཡོངས་སུ་འཛིན་པར་བྱེད་ན་མདོ་སྡེ་འདིའི་མཐུས་སྡུག་བསྔལ་མང་པོ་དང་། ཕྱིར་རྒོལ་བའི་དགྲ་དང་། མུ་གེ་དང་། ནད་དང་།
en: If you guard and possess this sūtra, then through the power of this sūtra many sufferings, attacks from enemies, famine, illness, and disease will all cease and be dispelled.

source: རིམས་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་ཞིང་ཡོངས་སུ་སེལ་བར་བྱེད་པས་དེའི་ཕྱིར་ཁྱེད་ཀྱིས་གལ་ཏེ་འཁོར་བཞི་པོ་དག་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ལེན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དུ་འདོན་པ་མཐོང་བར་གྱུར་ན་རབ་ཏུ་བརྩོན་པའི་སེམས་ཀྱིས་ཡོངས་སུ་བསྲུངས་ནས་གནོད་པ་བསལ་ཏེ་བདེ་བ་སྦྱིན་པར་བྱའོ། །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། གུས་པས་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མཆོག་ཏུ་རྣམ་པར་རྒྱལ་བ་མདོ་སྡེའི་རྒྱལ་པོ་འདི་སླད་མའི་དུས་ཀྱི་ཚེ་ཡུལ་ལམ། གྲོང་ངམ། གྲོང་ཁྱེར་རམ།
en: Therefore, if you see the four kinds of followers obtaining this king of sūtras, possessing it, reading it, and reciting it, then with a diligent mind you should guard them, dispel all harm, and bring them happiness.”

source: རིའམ། ནགས་ཚལ་ལམ། འབྲོག་དགོན་པའི་གནས་གང་ཡང་རུང་བ་དག་ཏུ་ཡོངས་སུ་སྤེལ་ཞིང་གནས་པར་གྱུར་པ་ན། ཡུལ་དེའི་རྒྱལ་པོས་མདོ་སྡེ་འདི་སེམས་རྩེ་གཅིག་ཏུ་མཉན་ནས་ཡོངས་སུ་བཟུང་སྟེ་བསྔགས་པ་བརྗོད་ནས་མཆོད་པར་བགྱིད་པ་དང་། མདོ་སྡེ་འདི་འཛིན་པའི་འཁོར་བཞི་པོ་དག་ལ་ཡོ་བྱད་སྦྱར་ཏེ་མཆོད་པ་བགྱིས་ནས་ཤིན་ཏུ་དང་བའི་སེམས་ཀྱིས་ཡོངས་སུ་བསྲུངས་ཏེ་གནོད་ཅིང་མི་བདེ་བ་དག་ཡོངས་སུ་སྤོང་བར་བགྱིད་ན།
en: The Four Mahārājas then rose from their seats, and with their upper robes over one shoulder, they knelt on their right knees, and with palms together in homage they said to the Bhagavat, “Venerable Bhagavat, in the future, when this Supremely Victorious King of Sūtras, the Sublime Golden Light is promulgated and is present in any land, village, town, mountain, forest, or solitary wilderness, and the king of that land listens to it single-mindedly and possesses it, praises it, makes offerings to it, and supplies requisites, making an offering of them, to the four kinds of followers who possess this sūtra, and protects them with a very trusting mind, he will dispel harm and unhappiness.

source: རྒྱུ་དང་རྐྱེན་དེས་བདག་ཅག་རྒྱལ་པོ་དེ་དང་མི་མང་པོ་རྣམས་ཡོངས་སུ་བསྲུངས་ནས་བདེ་བ་ལ་བཀོད་དེ། མྱ་ངན་དང་།
en: Because of those causes and conditions, we will protect that king and many people and bring them happiness.

source: སྡུག་བསྔལ་རྣམས་ཐག་རིང་དུ་སྤངས་ནས་ཚེ་འཕེལ་བ་དང་། གཟི་བྱིན་ཕུན་སུམ་ཚོགས་པར་བགྱིད་དོ།
en: We will banish misery and suffering far away, increase lifespans, and create a perfection of magnificence. “

source: །བཅོམ་ལྡན་འདས་ཡུལ་གྱི་རྒྱལ་པོ་དེས་འཁོར་བཞི་པོ་དག་མདོ་སྡེ་འདི་ཡོངས་སུ་འཛིན་པ་མཐོང་ནས་གུས་པས་ཡོངས་སུ་བསྲུངས་ཏེ་ཕ་མ་བཞིན་དུ་ཅི་འཚལ་བ་ཐམས་ཅད་སྦྱར་ཏེ་མཆོད་པར་བགྱིད་ན། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིས་རྟག་པར་ཡོངས་སུ་བསྲུངས་ནས་སེམས་ཅན་མང་པོ་ཀུན་གྱིས་བཀུར་བར་འགྱུར་བར་བགྱིད་པས།
en: Bhagavat, if the king of that land, on seeing the four kinds of followers possessing this sūtra, reverently protects them and offers and provides them with whatever they need as if they were his parents, then we Four Mahārājas will continually protect him, and he will be revered by the entire multitude of beings. “

source: དེའི་སླད་དུ་བདག་ཅག་གནོད་སྦྱིན་དང་འདྲེ་སྲིན་ཚད་མ་མཆིས་པ་དང་བཅས་པར་མདོ་སྡེའི་རྒྱལ་པོ་འདི་གང་དུ་སྤེལ་བའི་གནས་དེར་ལུས་སྦས་ནས་ཡོངས་སུ་སྐྱོབ་པ་དང་།
en: Therefore, for that purpose, we, together with an incalculable number of yakṣas and spirits, with our bodies unseen, will secretly be in the places where this king of sūtras is promulgated and is present, and we will defend and protect it so that its promulgation will be free from obstacles. “

source: ཡོངས་སུ་སྲུང་བ་བགྱིད་པས་བགེགས་རྣམས་དང་བྲལ་བར་འགྱུར་རོ། །མདོ་སྡེ་འདི་ཉན་པའི་གང་ཟག་དང་རྒྱལ་པོ་ལ་སོགས་པ་ལ་ཡང་ཡོངས་སུ་སྲུང་ཞིང་རྗེས་སུ་དྲན་པར་བགྱིད་པས་གནོད་པ་ཡོངས་སུ་བསལ་ནས་བདེ་བ་ལ་འགོད་པ་དང་། ཕྱོགས་གཞན་ནས་མཆིས་པའི་དགྲ་རྣམས་ཀྱང་སླར་ཟློག་པར་བགྱིད་པར་བགྱིད་དོ།
en: We will protect and remember the individuals, the kings, and so on, who will listen to this sūtra, so that harm will be dispelled, they will be brought to happiness, and enemies who come from other regions will be repulsed. “

source: །མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ཉན་པའི་ཚེ་ཉེ་འཁོར་ན་གནས་པའི་དགྲ་ཕྱིར་རྒོལ་བ་དམག་རྣམ་པ་བཞི་བཤམས་ཏེ། ཡུལ་དེ་དག་གཞོམ་མོ་སྙམ་དུ་སེམས་པར་གྱུར་ན་ཡང་བཅོམ་ལྡན་འདས་འདི་ལྟར་མདོ་སྡེའི་རྒྱལ་པོ་འདིའི་བྱིན་གྱི་བརླབས་ཀྱི་མཐུས་དེའི་ཚེ་ཉེ་འཁོར་གྱི་དགྲ་དེ་ལ་ཕྱིར་རྒོལ་བའི་དགྲ་ཐ་དད་པ་གཞན་མཆིས་ནས་གཞོམ་པར་བགྱིད་ཅིང་།
en: When any human king listens to this sūtra, if a neighboring enemy prepares a fourfold invading army with the thought, ‘I will defeat those lands,’ then, Bhagavat, the power of the blessing of this king of sūtras will cause that neighboring enemy to face another opposing enemy and be defeated. “

source: དེའི་ཡུལ་ཁམས་སུ་ལྟས་ངན་མང་པོ་དང་རིམས་ནད་རྣམས་འབྱུང་བར་འགྱུར་བས་དེའི་ཚེ་རྒྱལ་པོ་དེས་དེ་ལྟ་བུ་མཐོང་བ་དང་། དམག་རྣམ་པ་བཞི་བཤམས་ནས་ཡུལ་དེར་ཆས་ཏེ་གཞོམ་པར་བགྱིད་པ་ན་བདག་ཅག་ཀྱང་དེའི་ཚེ་གནོད་སྦྱིན་དང་འདྲེ་སྲིན་གྱི་འཁོར་ཚད་མ་མཆིས་ཤིང་མཐའ་མ་མཆིས་པ་སྙེད་དང་བཅས་པར་སོ་སོ་ནས་རང་གི་ལུས་སྦས་ཏེ་ཡོངས་སུ་བསྲུངས་ནས་གྲོགས་བགྱིས་པས་དེ་ཉིད་ཀྱིས་ཕྱིར་རྒོལ་བའི་དགྲ་དེ་རང་དུལ་བར་འགྱུར་བས་ཡུལ་ཁམས་དེར་མཆི་བའི་ཐུགས་ཀྱང་མི་ཐུབ་ན། ཕན་ཚུན་དམག་དང་མཚོན་གྱིས་འཐབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ལགས།
en: If many bad omens and diseases occur in his land, and at that time a neighboring king, on seeing that, prepares his fourfold army and goes to that land to defeat it, then at that time we, together with an incalculable and endless number of yakṣas and spirits, each one with a body unseen, will give our protection and aid so that the opposing enemy will become naturally subdued and unable to consider even going to that land, let alone engaging in a battle with armies and weapons.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་ཁྱེད་ཀྱིས་འདི་ལྟར་མདོ་སྡེ་འདི་ཡོངས་སུ་སྐྱོང་ཞིང་ཡོངས་སུ་སྲུང་བར་བྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: Then the Bhagavat said to the Four Mahārājas, “It is excellent, excellent that you mahārājas will defend and protect this sūtra. “

source: །ང་སྔོན་འདས་པའི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་འདས་པ་ན་དཀའ་བ་རྣམ་པ་སྣ་ཚོགས་སྤྱད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Many hundreds of thousands of quintillions of eons ago, I practiced various austerities and attained the highest, most complete enlightenment of buddhahood.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་བརྙེས་ནས་ཆོས་འདི་བསྟན་པ་ཡིན་པས་མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་མདོ་སྡེ་འདི་ཡོངས་སུ་བཟུང་ནས་བཀུར་སྟི་དང་མཆོད་པ་བྱེད་ན། གནོད་པ་རྣམས་ཉེ་བར་ཞི་ནས་རབ་ཏུ་བདེ་བར་འགྱུར།
en: Having attained omniscience, I taught this Dharma so that any human king who obtains this sūtra, honors it, and makes offerings to it will have all harms cease and will have perfect happiness. “

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་རྣམས་ཡོངས་སུ་སྲུང་བར་འགྱུར། ཕྱིར་རྒོལ་བའི་དགྲ་རྣམས་ཟློག་པར་འགྱུར།
en: He will protect the villages, towns, and markets and will repel invading enemies.

source: འཛམ་བུའི་གླིང་དུ་གཏོགས་པའི་རྒྱལ་པོ་ཐམས་ཅད་ལ་གནོད་པ་དང་། འཐབ་པ་དང་། རྩོད་པའི་དངོས་པོ་རྣམས་གཏན་མེད་པར་འགྱུར་རོ།
en: There will never be any harm, fighting, or dispute for all the kings within Jambudvīpa. “

source: །རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་འཛམ་བུའི་གླིང་འདི་ན་ཡོད་པའི་གྲོང་དང་། གྲོང་ཁྱེར་དང་། རི་དང་། གྲོང་རྡལ་བརྒྱད་ཁྲི་བཞི་སྟོང་དག་གི་མིའི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་རྣམས་ཀྱང་སོ་སོ་ནས་རང་རང་གི་ཡུལ་དུ་ལོངས་སྤྱོད་ཀྱི་བདེ་བ་མྱོང་ཞིང་རང་དབང་དང་ལྡན་པར་འགྱུར།
en: Four Mahārājas, know that the eighty-four thousand kings of the eighty-four thousand villages, towns, mountains, and markets in this Jambudvīpa will experience the happiness of what is enjoyed in their own domains and will have independence.

source: །ནོར་དང་རིན་པོ་ཆེ་དཔལ་འབྱོར་གྱིས་རྒྱས་པ་དག་ལ་ལོངས་སྤྱོད་པར་བྱེད་པས་ཕན་ཚུན་འཕྲོག་པར་མི་བྱེད་ཅིང་སྔོན་གྱི་རྒྱུ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་སྨིན་པ་དག་ལ་ལོངས་སྤྱོད་པར་བྱེད་པས།
en: Because they enjoy increased wealth, jewels, and prosperity, they will not steal from one another but will enjoy the ripened results of their past causes.

source: བསམ་པ་ངན་པ་བསྐྱེད་ནས་གཞན་གྱི་ཡུལ་ལ་འདོད་པས་ཡོངས་སུ་ཚོལ་བ་མེད་དེ།
en: Therefore, they will not give rise to bad thoughts and desire and seek the lands of others.

source: ཐམས་ཅད་འདོད་པ་ཆུང་ཞིང་ཕན་འདོགས་པའི་བསམ་པ་སྐྱེ་བར་འགྱུར།
en: They will all have few desires and give rise to thoughts of benefiting others.

source: འཐབ་པ་དང་། རྩོད་པ་དང་། བཅིང་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་ཡང་མེད་པར་འགྱུར།
en: There will be no suffering from fighting, quarreling, bondage, and so on.

source: ཡུལ་དེ་དག་ན་གནས་པའི་མི་རྣམས་ཀྱང་རང་བཞིན་གྱིས་བདེ་བ་མྱོང་བར་འགྱུར། བླ་འོག་མཐུན་ཞིང་ཆུ་དང་འོ་མ་འདྲེས་པ་ལྟ་བུར་སེམས་ཀྱིས་ཕན་ཚུན་སྡུག་ཅིང་བཀུར་བར་འགྱུར། རབ་ཏུ་དགའ་བས་རྣམ་པར་རྩེ་བར་འགྱུར། བྱམས་པ་དང་།
en: The people living in those lands will also naturally experience happiness; those above and below will be in harmony like water and milk mixed, so that they will be pleasant and respectful to one another.

source: སྙིང་རྗེས་ཕན་འདོགས་ཤིང་དགེ་བའི་རྩ་བ་འཕེལ་བར་བྱེད་པས་རྒྱུ་དང་རྐྱེན་དེས་ན་འཛམ་བུའི་གླིང་འདི་རབ་ཏུ་བདེ་ཞིང་ལོ་ལེགས་པ་དང་། མི་རྣམས་རྒྱས་ཤིང་རབ་ཏུ་གང་བར་འགྱུར། ས་ཆེན་པོ་མཐུ་དང་ལྡན་པར་འགྱུར། གྲང་དྲོ་རན་པར་འགྱུར། དུས་ཚིགས་མི་མཐུན་པ་མེད་པར་འགྱུར། ཉི་མ་དང་། ཟླ་བ་དང་། གཟའ་དང་། རྒྱུ་སྐར་རྣམས་ཀྱང་སྔོན་གྱི་གནས་ལས་འཕོ་ཞིང་འགྱུར་བ་མེད་པར་འགྱུར།
en: They will delight in one another and therefore be affectionate, loving, and compassionate and will benefit one another, thus generating roots of merit.

source: རླུང་དང་ཆར་པ་ཡང་དུས་བཞིན་དུ་ལྡང་ཞིང་འབབ་པར་འགྱུར། ལྟས་ངན་རྣམས་དང་འབྲལ་བར་འགྱུར། ནོར་དང་རིན་པོ་ཆེ་རྣམས་འབྱོར་ཅིང་རྒྱས་པར་འགྱུར། སེམས་ལ་སེར་སྣའི་འཇུངས་པ་མེད་ཅིང་རྟག་པར་སྦྱིན་པ་གཏོང་བར་འགྱུར། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་འགྱུར། མི་རྣམས་ཚེ་འཕོས་པར་གྱུར་ན་ཡང་ཕལ་ཆེར་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་བས་ལྷའི་འཁོར་རྣམས་རབ་ཏུ་འཕེལ་བར་འགྱུར་བར་རིག་པར་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་དག་མ་འོངས་པའི་དུས་ན་མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག །མདོ་སྡེ་འདི་མཉན་ཏེ་ཡོངས་སུ་བསྲུངས་ནས་གུས་པས་མཆོད་པ་བྱེད་པ་དང་།
en: Through those causes and conditions, this Jambudvīpa will become happy, with excellent harvests; the population will increase, filling the land; the great earth will become powerful; the temperature will be even; there will be no adverse seasons; the sun, moon, planets, and constellations will not leave their orbits but will be constant; the wind will rise and the rain fall at the appropriate times; there will be freedom from bad omens; wealth and jewels will be obtained and will increase; the people’s minds will be without miserliness and they will be generous; they will follow the path of the ten good actions; and when people pass away, most will be reborn in the higher realms, so that the population of the paradises will increase. “

source: མདོ་སྡེ་འཛིན་པའི་འཁོར་བཞི་པོ་དག་ལ་བླ་མར་བྱེད་ཅིང་བསྔགས་པ་བརྗོད་པར་འདོད་པ་དང་། གཞན་ཡང་ཁྱེད་འཁོར་དང་བཅས་པ་དང་། གནོད་སྦྱིན་གྱི་འཁོར་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་ལ་ཕན་པ་དང་། བདེ་བས་ཕན་འདོགས་པར་འདོད་ན་དེའི་ཕྱིར་རྒྱལ་པོ་དེས་རྟག་པར་མདོ་སྡེའི་རྒྱལ་པོ་དམ་པ་འདི་མཉན་ནས་ཡོངས་སུ་གཟུང་བར་བྱས་ཏེ། ཡང་དག་པའི་ཆོས་ཀྱི་ཆུ་བདུད་རྩིའི་རོ་མཆོག་དམ་པ་འདི་ཐོས་པའི་དབང་གིས་ཁྱེད་ལ་སོགས་པའི་ལུས་དང་སེམས་ཀྱི་མཐུ་སྟོབས་འཕེལ་བར་བྱེད་པས་བརྩོན་འགྲུས་དང་ལྡན་ཞིང་དཔའ་བ་དང་། བསོད་ནམས་དང་གཟི་བྱིན་རྣམས་རབ་ཏུ་རྒྱས་པར་འགྱུར་རོ།
en: Mahārājas, in the future, when there is a human king who listens to this sūtra, protects it, reverently makes offerings to it, and wishes to venerate and praise the four kinds of followers who possess the sūtra, and moreover wishes to bring benefit and happiness to you and your followers and your entire entourage of countless hundreds of thousands of yakṣas, and for that reason that king constantly listens to this sublime king of sūtras and possesses it, then through the power of hearing this sublime, supreme flavor of the amṛta of the river of the Dharma, the power of your bodies and minds and those of others will increase so that you will have diligence and increased courage, merit, and magnificence. “

source: །མིའི་རྒྱལ་པོ་དེ་དག་གལ་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་མདོ་སྡེ་འདི་མཉན་ནས་ཡོངས་སུ་འཛིན་པར་བྱེད་ན་དེ་ནི་ཡངས་ཤིང་རྒྱ་ཆེ་བ་དང་། ཤིན་ཏུ་དཀོན་པའི་མཆོད་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ང་ལ་མཆོད་པ་བྱེད་པར་འགྱུར་ཏེ། གང་གིས་ང་ལ་མཆོད་པ་བྱས་པ་གང་ཡིན་པ་དེ་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་རྣམས་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ།
en: If those human kings listen single-mindedly to this sūtra and possess it, then they will be making vast, immense, extremely rare offerings to me, the perfect buddha, Śākyamuni, and those who make those offerings to me will have made offerings to the many hundreds of thousands of quintillions of past, future, and present buddhas.

source: །གང་གིས་དུས་གསུམ་གྱི་སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བྱས་ནས་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་སྙེད་འཐོབ་པར་འགྱུར་བས།
en: Those who have made offerings to the buddhas of the three times will attain an immeasurable aggregation of inconceivable merit.

source: རྒྱུ་དང་རྐྱེན་དེས་ན་ཁྱེད་ལ་སོགས་པས་རྒྱལ་པོ་དེ་དང་། བཙུན་མོ་དང་། སླས་དང་། འཁོར་རྣམས་ཡོངས་སུ་བསྲུངས་ནས་གནོད་ཅིང་ཉམ་ང་བ་མེད་པར་བྱས་ཏེ།
en: Therefore, because of that cause and condition, you and the others will have protected those kings and their queens, attendants, and courts, and you will eliminate harm and misery.

source: ཕོ་བྲང་བསྲུང་བའི་ལྷ་རྣམས་ཀྱང་རྟག་ཏུ་བདེ་བའི་ལོངས་སྤྱོད་མྱོང་བ་ལ་འགོད་པར་བྱེད་ན། བསོད་ནམས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་འགྱུར།
en: If they also establish the deities who guard the palace in the constant enjoyment of happiness, then they will possess inconceivable merit.

source: ཡུལ་དེ་དག་ན་གནས་པའི་མི་རྣམས་ཀྱང་འདོད་པ་ལྔའི་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་མྱོང་བར་འགྱུར། དངོས་པོ་ངན་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སླད་མའི་དུས་ཀྱི་ཚེ་མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་འདི་ལྟར་གསེར་འོད་དམ་པའི་མདོ་སྡེ་འདི་ཉན་པར་མོས་པ་དང་། བདག་ཉིད་དང་། བཙུན་མོ་དང་། རྒྱལ་བུ་ནས་ཕོ་བྲང་ནང་གི་སླས་ལ་སོགས་པའི་བར་དག་དང་།
en: The humans who live in those lands will experience a variety of the happinesses of the five sensory pleasures, and all bad things will cease.”

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཕོ་བྲང་ཡོངས་སུ་སྲུང་ཞིང་སྐྱོབ་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དགའ་བ་མཆོག་དམ་པ་དང་། རབ་ཏུ་དབེན་པའི་བདེ་བ་འཐོབ་པར་འཚལ་བ་དང་། ཚེ་འདི་ཉིད་ལ་རྒྱལ་ཐབས་བཙུན་ཞིང་མཐོ་བ་དང་། དབང་ཕྱུག་དང་ལྡན་ཞིང་དར་བ་དང་། རྟག་ཏུ་འཕེལ་བར་འཚལ་བ་དང་། གཞན་ཡང་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མ་མཆིས་ཤིང་མཐའ་མ་མཆིས་པ་ཡོངས་སུ་སྡུད་པ་དང་། རང་གི་ཡུལ་དུ་ཕྱིར་རྒོལ་བའི་དགྲ་དང་། མྱ་ངན་དང་། འཁྲུག་པ་དང་། གདོན་བགེགས་ཀྱི་དངོས་པོ་རྣམས་མ་མཆིས་པར་འཚལ་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་མིའི་རྒྱལ་པོ་དེས་བག་མ་མཆིས་པས་སེམས་གཡེང་བར་མི་བགྱི་ཞིང་ཤིན་ཏུ་གུས་པ་བསྐྱེད་དེ་བསམ་པ་ཐག་པ་ནས་མདོ་སྡེའི་རྒྱལ་པོ་མཆོག་དམ་པ་འདི་མཉན་ཅིང་ཡོངས་སུ་གཟུང་བར་བགྱིའོ།
en: Then the Four Mahārājas said to the Bhagavat, “Bhagavat, in the future, a human king who aspires to listen to this Sūtra of the Sublime Golden Light and wishes to protect and defend himself, his queens, his princes, and so on, as far as the palace attendants, and so on, and also the cities, markets, and palaces; and who wishes to attain sublime, supreme, inconceivable happiness and the bliss of solitude; and who wishes to have in that life a noble and high sovereignty, to possess, spread, and constantly increase his power; and if he also wishes to accumulate an endless, immeasurable aggregation of inconceivable merit and wishes for there to be no invading armies, misery, disturbances, demons, or obstacles in his land, then, Bhagavat, that human king should be attentive, undistracted, and reverential and listen sincerely to this sublime, supreme king of sūtras and possess it. “
